%----------------------------------------%
%--------弹道导弹拦截系统初始化程序--------%
%--------仅供《系统仿真技术》上机用--------%
%--------------HIT20170502---------------%
%----------------------------------------%
clear; clc;
%-------导弹和目标初始参数-------%

GM=3.986e5;                 %地心引力常数,km^3/s^2

P0_T = [0;6378.2];          %目标初始位置,km
P0_M = [4510.1;4510.1];     %目标初始速度,km/s
V0_T = [6.7856;2.8801];     %导弹初始位置,km
V0_M = [2.0056;5.9535];     %导弹初始速度,km/s

R_Earth = 6378.2;           %地球半径,km
%--------制导律和仿真参数--------%
S_time = 0.1;               %仿真补偿
amax   = 4;                 %导弹最大加速度,m/s^2
N_PN   = 5;                 %比例导引律系数

disp('初始化完成，可以开始仿真了')
